InformationRegisters/ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СоответствиеКлиентовИСотрудниковОрганизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ВыборСтрудниковДляСтатусаСотрудник/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда   
		Клиент = Параметры.Клиент;  
		ФИО = ЛБ_ОбщийМодуль.ПолучитьФИО(Клиент);
		
		ЭтаФорма.ТолькоПросмотр = Параметры.ТолькоПросмотр;
		ЗаполнитьСписокСотрудников();
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.ТолькоПросмотр Тогда  
		Элементы.ФормаКоманднаяПанель.Доступность = Ложь; 
		Элементы.СотрудникиКоманднаяПанель.Доступность = Ложь;
		Элементы.Сотрудники.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСотрудников()
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации КАК ЛБ_СоответствиеКлиентовИСотрудниковОрганизации
	               |ГДЕ
	               |	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Клиент = &Клиент";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Сотрудники.Загрузить(ТаблицаЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ТекСтрока = Элементы.Сотрудники.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Ключ", ТекСтрока.Сотрудник);
    ОткрытьФорму("Справочник.ЛБ_Сотрудники.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура НовыйСотрудник(Команда)  
	ОткрытьФорму("Справочник.ЛБ_Сотрудники.ФормаОбъекта",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры     

&НаСервере
Процедура ЗаписатьИзмененияВРегистр()
	//удалим записи по клиенту
	НаборЗаписей = РегистрыСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Клиент.Установить(Клиент);
    НаборЗаписей.Записать();  
	
	//и запишем новую информацию
	Для Каждого СтрокаТаблицы Из Сотрудники Цикл 
	   
	   НоваяЗапись = НаборЗаписей.Добавить(); 
	   
	   НоваяЗапись.Клиент = Клиент; 
	   НоваяЗапись.Сотрудник = СтрокаТаблицы.Сотрудник; 
	КонецЦикла; 
    НаборЗаписей.Записать(); 
КонецПроцедуры	

&НаСервере
Функция ПроверитьСотрудников() 
	СообщениеОбОшибках = "";
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Клиент КАК Клиент
	               |ИЗ
	               |	РегистрСведений.ЛБ_СоответствиеКлиентовИСотрудниковОрганизации КАК ЛБ_СоответствиеКлиентовИСотрудниковОрганизации
	               |ГДЕ
	               |	НЕ ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Клиент = &Клиент
	               |	И ЛБ_СоответствиеКлиентовИСотрудниковОрганизации.Сотрудник = &Сотрудник";

	Для Каждого СтрокаТаблицы Из Сотрудники Цикл 
		Запрос.УстановитьПараметр("Сотрудник", СтрокаТаблицы.Сотрудник);  
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда  
			СообщениеОбОшибках = СообщениеОбОшибках + ?(ПустаяСтрока(СообщениеОбОшибках), "", Символы.ПС) + "Для сотрудника " + СокрЛП(СтрокаТаблицы.Сотрудник) + " уже установлено соответствие с клиентом " + СокрЛП(Выборка.Клиент);
		КонецЕсли;	
	КонецЦикла;
	Возврат СообщениеОбОшибках;
КонецФункции

&НаКлиенте
Процедура ОК(Команда) 
	ТекстПроверки = ПроверитьСотрудников();
	Если ПустаяСтрока(ТекстПроверки) Тогда
		ЗаписатьИзмененияВРегистр(); 
		ЭтаФорма.Закрыть();        
	Иначе
		Предупреждение(ТекстПроверки, 60);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
